/**
 * merge.js
 * 
 * @version : 1.0
 * @license : Copyright (c) 2012-2015 Usatama
 *            Released under the MIT license
 */

function merge(){

	// 内部変数の宣言 --------------------------------


	//------------------------------------------------
	// （共通）ファンクション生成時、初期化処理
	//------------------------------------------------
	this.init = function() {
		
	}
	this.init();

	//------------------------------------------------
	// （共通）シーンロード前、再初期化処理
	//------------------------------------------------
	this.reset = function() {
		
	}

	//------------------------------------------------
	// EXECによる呼び出し処理
	//------------------------------------------------
	this.merge = function(s0,s1,s2,s3,s4,s5,s6,s7,s8,s9,s10,s11,s12,s13,s14,s15,s16,s17,s18,s19,s20,s21,s22,s23,s24,s25,s26,s27,s28,s29,s30) {

		var txt = "" +blk(s0 ,"")
					 +blk(s1 ,"")
					 +blk(s2 ,"")
					 +blk(s3 ,"")
					 +blk(s4 ,"")
					 +blk(s5 ,"")
					 +blk(s6 ,"")
					 +blk(s7 ,"")
					 +blk(s8 ,"")
					 +blk(s9 ,"")
					 +blk(s10,"")
					 +blk(s11,"")
					 +blk(s12,"")
					 +blk(s13,"")
					 +blk(s14,"")
					 +blk(s15,"")
					 +blk(s16,"")
					 +blk(s17,"")
					 +blk(s18,"")
					 +blk(s19,"")
					 +blk(s20,"")
					 +blk(s21,"")
					 +blk(s22,"")
					 +blk(s23,"")
					 +blk(s24,"")
					 +blk(s25,"")
					 +blk(s26,"")
					 +blk(s27,"")
					 +blk(s28,"")
					 +blk(s29,"");

		if(isNvl(s30)==false){alert("merge 限界数を超えたよ")}

		return txt;
	}

	// END -------------------------------------------
}
