/**
 * play.js
 * 
 * @version : 1.0
 * @license : Copyright (c) 2012-2015 Usatama
 *            Released under the MIT license
 */

function play(){

	// 内部変数の宣言 --------------------------------
		var oPlayList = null;	//シーンファイル情報詰込
		var iCnt      = 0;		//シーン内カーソル位置カウント
		var iLdCnt    = 0;		//ロードファイルカウント

	//------------------------------------------------
	// （共通）ファンクション生成時、初期化処理
	//------------------------------------------------
	this.init = function() {
		
	}
	this.init();

	//------------------------------------------------
	// （共通）シーンロード前、再初期化処理
	//------------------------------------------------
	this.reset = function() {
		oPlayList = new Array;
		iCnt      = 0;
		iLdCnt    = 0;
	}

	//------------------------------------------------
	// シーンファイル内、処理種類の返却
	//------------------------------------------------
	this.getKind = function() {
		return oPlayList[iCnt].kind;
	}

	//------------------------------------------------
	// シーンファイル内、処理一覧の返却
	//------------------------------------------------
	this.getPlayList = function() {
		return oPlayList[iCnt];
	}

	//------------------------------------------------
	// 処理を処理一覧に追加 ＆ 処理一覧の最大＋１
	//------------------------------------------------
	this.setPlayList = function(play) {
		oPlayList[iLdCnt] = play;
		iLdCnt++;
	}

	//------------------------------------------------
	// シーンファイル内、カーソル位置＋１
	//------------------------------------------------
	this.incPlayCnt = function() {
		iCnt++;
	}

	//------------------------------------------------
	// シーンファイル内、カーソル位置－１
	//------------------------------------------------
	this.decPlayCnt = function() {
		iCnt--;
	}

	//------------------------------------------------
	// シーンファイル内、カーソル位置の設定
	//------------------------------------------------
	this.setPlayCnt = function(cnt) {
		iCnt=cnt;
	}

	//------------------------------------------------
	// シーンファイル内、カーソル位置の返却
	//------------------------------------------------
	this.getPlayCnt = function() {
		return iCnt;
	}

	//------------------------------------------------
	// シーンファイル内、処理一覧の最大の返却
	//------------------------------------------------
	this.getPlayLdCnt = function() {
		return iLdCnt;
	}

	// END -------------------------------------------
}
